app/controllers/dailies_controller.rb

  def index
    @dailies = Daily.all
---
SELECT * FROM "dailies"