app/controllers/executive_positions_controller.rb

SELECT * FROM "executive_positions"
---
  def index
    @executive_positions = ExecutivePosition.all