app/controllers/golfers_controller.rb

SELECT * FROM "golfers"
---
  def index
    @golfers = Golfer.all

SELECT * FROM "golfers" WHERE ("golfers"."id" = 1)
---
  def show
    @golfer = Golfer.find(params[:id])

SELECT * FROM "golfers" WHERE ("golfers"."id" = 1)
---
  def edit
    @golfer = Golfer.find(params[:id])

INSERT INTO "golfers" ("city", "year_joined", "status", "zip", "updated_at", "cell", "comments", "birthdate", "firstname", "lastname", "membership_status", "street_address", "home_phone", "state", "email", "created_at") VALUES('Woodbridge', 2001, 't', '22192', '2010-12-27 20:03:05', '704sdfsdfs', 'This is a test user', '2010-12-27', 'Meagan', 'Rollins', NULL, '12625 Kempston Ln', '7034917797', NULL, 'ikebarnes@gmail.com', '2010-12-27 20:03:05')
---
  def create
    @golfer = Golfer.new(params[:golfer])

    respond_to do |format|
      if @golfer.save

SELECT * FROM "golfers" WHERE ("golfers"."id" = 1)
UPDATE "golfers" SET "membership_status" = '', "updated_at" = '2010-12-27 20:07:34' WHERE "id" = 1
---
  def update
    @golfer = Golfer.find(params[:id])

    respond_to do |format|
      if @golfer.update_attributes(params[:golfer])