app/controllers/ringer_scores_controller.rb

  def index
    @ringer_scores = RingerScore.all
---
SELECT * FROM "ringer_scores"