app/controllers/yearlies_controller.rb

SELECT * FROM "yearlies"
---
  def index
    @yearlies = Yearly.all